# Groupby Method :

- **Groupby allows you to group together rows based off of a column and perform an aggregate function *(i.e. taking in multiple inputs and giving single output for example, sum,average,mean,etc...)* on them.**

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = { 'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person' : ['Sam', 'Charlie', 'Ani', 'Vanessa', 'Clay', 'Sarah'],
        'Sales' : [200,120,340,124,243,350]
       }

In [3]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Ani    340
3    MSFT  Vanessa    124
4      FB     Clay    243
5      FB    Sarah    350

In [4]:
# grouping rows together based of the column names

byComp = df.groupby('Company')
byComp

In [5]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [6]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [7]:
# Step-Deviation
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [8]:
# It will ignore if grouping is not possible
df.groupby('Person').mean()

         Sales
Person
Ani      340.0
Charlie  120.0
Clay     243.0
Sam      200.0
Sarah    350.0
Vanessa  124.0

In [9]:
# It will return Person, 'cause it was able to count 
df.groupby('Company').count()
# It also returns Person column in max(), min() like functions

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [10]:
# stacking more commands for making it inline
df.groupby("Company").sum().loc['FB']

Sales    593
Name: FB, dtype: int64

---

### Using `.describe()` for grabbing bunch of info:

In [11]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

### Transposing a DataFrame:
> Syntax: `df_name.T` OR `df_name.transpose()`

In [12]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Ani    340
3    MSFT  Vanessa    124
4      FB     Clay    243
5      FB    Sarah    350

In [13]:
df.T

            0        1     2        3     4      5
Company  GOOG     GOOG  MSFT     MSFT    FB     FB
Person    Sam  Charlie   Ani  Vanessa  Clay  Sarah
Sales     200      120   340      124   243    350

In [14]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [15]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

---